# Instalaciones necesarias

In [1]:
!pip3 install pandas numpy seaborn kaggle matplotlib sqlalchemy psycopg2-binary

Requirement already satisfied: pandas in ./venv/lib/python3.13/site-packages (2.3.2)
Requirement already satisfied: numpy in ./venv/lib/python3.13/site-packages (2.3.3)
Requirement already satisfied: seaborn in ./venv/lib/python3.13/site-packages (0.13.2)
Requirement already satisfied: kaggle in ./venv/lib/python3.13/site-packages (1.7.4.5)
Requirement already satisfied: matplotlib in ./venv/lib/python3.13/site-packages (3.10.6)
Requirement already satisfied: sqlalchemy in ./venv/lib/python3.13/site-packages (2.0.43)
Requirement already satisfied: psycopg2-binary in ./venv/lib/python3.13/site-packages (2.9.10)
Requirement already satisfied: python-dateutil>=2.8.2 in ./venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: bleach in ./venv/lib/python3.13/site-packages (from kaggle) (6.2.0)
Requirement already satisfied: certifi>=14.05.14 in ./venv/lib/python3.13/site-packages (from kaggle) (2025.8.3)
Requirement already satisfied: charset-normalizer in ./venv/lib/python3.13/site-packages (from kaggle) (3.4.3)
Requirement already satisfied: idna in ./venv/lib/python3.13/site-packages (from kaggle) (3.10)
Requirement already satisfied: protobuf in ./venv/lib/python3.13/site-packages (from kaggle) (6.32.1)
Requirement already satisfied: python-slugify in ./venv/lib/python3.13/site-packages (from kaggle) (8.0.4)
Requirement already satisfied: requests in ./venv/lib/python3.13/site-packages (from kaggle) (2.32.5)
Requirement already satisfied: setuptools>=21.0.0 in ./venv/lib/python3.13/site-packages (from kaggle) (80.9.0)
Requirement already satisfied: six>=1.10 in ./venv/lib/python3.13/site-packages (from kaggle) (1.17.0)
Requirement already satisfied: text-unidecode in ./venv/lib/python3.13/site-packages (from kaggle) (1.3)
Requirement already satisfied: tqdm in ./venv/lib/python3.13/site-packages (from kaggle) (4.67.1)
Requirement already satisfied: urllib3>=1.15.1 in ./venv/lib/python3.13/site-packages (from kaggle) (2.5.0)
Requirement already satisfied: webencodings in ./venv/lib/python3.13/site-packages (from kaggle) (0.5.1)
Requirement already satisfied: contourpy>=1.0.1 in ./venv/lib/python3.13/site-packages (from matplotlib) (1.3.3)
Requirement already satisfied: cycler>=0.10 in ./venv/lib/python3.13/site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in ./venv/lib/python3.13/site-packages (from matplotlib) (4.59.2)
Requirement already satisfied: kiwisolver>=1.3.1 in ./venv/lib/python3.13/site-packages (from matplotlib) (1.4.9)
Requirement already satisfied: packaging>=20.0 in ./venv/lib/python3.13/site-packages (from matplotlib) (25.0)
Requirement already satisfied: pillow>=8 in ./venv/lib/python3.13/site-packages (from matplotlib) (11.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in ./venv/lib/python3.13/site-packages (from matplotlib) (3.2.3)
Requirement already satisfied: greenlet>=1 in ./venv/lib/python3.13/site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in ./venv/lib/python3.13/site-packages (from sqlalchemy) (4.15.0)

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
import psycopg2
import os

## Extraccion de datos (Extract)

In [3]:
from pathlib import Path
import shutil

# Cargar el archivo kaggle.json para autenticación con la API de Kaggle

# Suponiendo que kaggle.json está en el directorio actual
kaggle_json = Path('kaggle.json')
kaggle_dir = Path.home() / '.kaggle'
kaggle_dir.mkdir(exist_ok=True)
shutil.copy(str(kaggle_json), str(kaggle_dir / 'kaggle.json'))

# Establecer permisos adecuados
os.chmod(str(kaggle_dir / 'kaggle.json'), 0o600)

In [4]:
!kaggle datasets download -d mehmettahiraslan/customer-shopping-dataset -p ./ --unzip

Dataset URL: https://www.kaggle.com/datasets/mehmettahiraslan/customer-shopping-dataset
License(s): CC0-1.0
Downloading customer-shopping-dataset.zip to .
  0%|                                               | 0.00/1.63M [00:00<?, ?B/s]
100%|██████████████████████████████████████| 1.63M/1.63M [00:00<00:00, 1.50GB/s]

In [5]:
df = pd.read_csv("./customer_shopping_data.csv")
df.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,9/11/2021,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16/05/2021,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24/10/2021,Kanyon

## Transformar datos (Transform)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99457 entries, 0 to 99456
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_no      99457 non-null  object
 1   customer_id     99457 non-null  object
 2   gender          99457 non-null  object
 3   age             99457 non-null  int64
 4   category        99457 non-null  object
 5   quantity        99457 non-null  int64
 6   price           99457 non-null  float64
 7   payment_method  99457 non-null  object
 8   invoice_date    99457 non-null  object
 9   shopping_mall   99457 non-null  object
dtypes: float64(1), int64(2), object(7)
memory usage: 7.6+ MB

### Verificar datos duplicados

In [7]:
duplicated_rows = df[df.duplicated()]
duplicated_rows

Empty DataFrame
Columns: [invoice_no, customer_id, gender, age, category, quantity, price, payment_method, invoice_date, shopping_mall]
Index: []

In [8]:
duplicated_rows = df[df.duplicated(subset=[
    'customer_id',
    'gender', 
    'age', 
    'category', 
    'quantity',
    'price',
    'payment_method',
    'shopping_mall'
])]
duplicated_rows

Empty DataFrame
Columns: [invoice_no, customer_id, gender, age, category, quantity, price, payment_method, invoice_date, shopping_mall]
Index: []

In [9]:
duplicated_rows = df[df.duplicated(subset='invoice_no')]
duplicated_rows

Empty DataFrame
Columns: [invoice_no, customer_id, gender, age, category, quantity, price, payment_method, invoice_date, shopping_mall]
Index: []

### Cambiar formto de fecha (invoice_date)

In [10]:
df['invoice_date'] = pd.to_datetime(df['invoice_date'], errors='coerce', dayfirst=True)
df.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,Kanyon

### Crear columna nueva (total_amount)

In [29]:
df['total_amount'] = df['quantity'] * df['price']
df.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall,total_amount
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,Kanyon,7502.00
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,Forum Istanbul,5401.53
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,Metrocity,300.08
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,Metropol AVM,15004.25
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,Kanyon,242.40

### Verificar categorias

In [30]:
df['category'].unique()

array(['Clothing', 'Shoes', 'Books', 'Cosmetics', 'Food & Beverage',
       'Toys', 'Technology', 'Souvenir'], dtype=object)

## Carga de datos (Load)

In [128]:
# Copia de seguridad del dataset original
df_star = df.copy()

### Table customer (clientes)

In [129]:
dim_customer = df_star[['gender', 'age']].drop_duplicates().reset_index(drop=True)
dim_customer['customer_id'] = dim_customer.index + 1
dim_customer.head()

   gender  age  customer_id
0  Female   28            1
1    Male   21            2
2    Male   20            3
3  Female   66            4
4  Female   53            5

### Table products (productos)

In [130]:
dim_product = df_star[['category', 'price', 'quantity']].drop_duplicates().reset_index(drop=True)
dim_product['product_id'] = dim_product.index + 1
df_star = df_star.merge(dim_product, on=['category', 'price', 'quantity'], how='left')

df_star.head()

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall,total_amount,product_id
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,2022-08-05,Kanyon,7502.00,1
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,2021-12-12,Forum Istanbul,5401.53,2
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,2021-11-09,Metrocity,300.08,3
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,2021-05-16,Metropol AVM,15004.25,4
4,I337046,C189076,Female,53,Books,4,60.60,Cash,2021-10-24,Kanyon,242.40,5

### Table payments (pagos)

In [131]:
dim_payment = df_star[['payment_method', 'invoice_date']].drop_duplicates().reset_index(drop=True)
dim_payment['payment_id'] = dim_payment.index + 1
dim_payment.head()

  payment_method invoice_date  payment_id
0    Credit Card   2022-08-05           1
1     Debit Card   2021-12-12           2
2           Cash   2021-11-09           3
3    Credit Card   2021-05-16           4
4           Cash   2021-10-24           5

### Table malls (Tiendas)

In [132]:
dim_mall = df_star[['shopping_mall']].drop_duplicates().reset_index(drop=True)
dim_mall['mall_id'] = dim_mall.index + 1
dim_mall.head()

    shopping_mall  mall_id
0          Kanyon        1
1  Forum Istanbul        2
2       Metrocity        3
3    Metropol AVM        4
4    Istinye Park        5

### Table sales (ventas)

In [133]:
df_star = df_star.merge(
    dim_customer,
    on=['gender', 'age'],
    how='left'
)
df_star = df_star.rename(columns={'customer_id_y': 'customer_id'})



df_star = df_star.merge(
    dim_product,
    on=['category', 'price', 'quantity'],
    how='left'
)
df_star = df_star.rename(columns={'product_id_y': 'product_id'})

df_star = df_star.merge(
    dim_payment,
    on=['payment_method', 'invoice_date'],
    how='left'
)

df_star = df_star.merge(
    dim_mall,
    on=['shopping_mall'],
    how='left'
)


fact_sales = df_star[['invoice_no', 'customer_id', 'product_id', 'payment_id', 'mall_id', 'total_amount']]
fact_sales.head()

  invoice_no  customer_id  product_id  payment_id  mall_id  total_amount
0    I138884            1           1           1        1       7502.00
1    I317333            2           2           2        2       5401.53
2    I127801            3           3           3        3        300.08
3    I173702            4           4           4        4      15004.25
4    I337046            5           5           5        1        242.40

### Conexion a base datos

In [134]:
engine = create_engine("postgresql://admin:X7vpQ2rtL9sWzeB8@localhost:5433/retail_data_warehouse")

### Insertar datos

In [135]:
dim_customer.to_sql('dim_customer', engine, if_exists='append', index=False)
dim_product.to_sql('dim_product', engine, if_exists='append', index=False)
dim_payment.to_sql('dim_payment', engine, if_exists='append', index=False)
dim_mall.to_sql('dim_mall', engine, if_exists='append', index=False)
fact_sales.to_sql('fact_sales', engine, if_exists='append', index=False)

457